In [27]:
import pandas as pd

In [28]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series\n", series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [29]:
# create series from dict element
data = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data)
print("Series from dictionary \n", series_dict)

Series from dictionary
 a    1
b    2
c    3
dtype: int64

In [30]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [31]:
# Dataframe
#Create df from dict of list
data = {
    'Name':['Shruti','Shravani','Anuj'],
    'Age':[20,15,15],
    'City':['Thane','Thane','Thane']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age   City
0    Shruti   20  Thane
1  Shravani   15  Thane
2      Anuj   15  Thane
<class 'pandas.core.frame.DataFrame'>

In [32]:
# Create df from list of dict
data = [
    {'Name':'Shruti', 'Age': 20, 'City': 'Thane'},
    {'Name':'Shravani', 'Age': 15, 'City': 'Thane'},
    {'Name':'Anuj', 'Age': 15, 'City': 'Thane'}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age   City
0    Shruti   20  Thane
1  Shravani   15  Thane
2      Anuj   15  Thane
<class 'pandas.core.frame.DataFrame'>

In [33]:
#df = pd.read_csv('sales_data.csv')
#df.head(5)
#df.tail(5)

In [34]:
# Accesing specified elements
df['Name']

0      Shruti
1    Shravani
2        Anuj
Name: Name, dtype: object

In [35]:
df.loc[0]

Name    Shruti
Age         20
City     Thane
Name: 0, dtype: object

In [36]:
df.iloc[0][2]

C:\Users\abc\AppData\Local\Temp\ipykernel_5764\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Thane'

In [37]:
#accessing specified element
df.at[1,'Age']

np.int64(15)

In [38]:
# data manipulation with data frame
# add column
df['Salary'] = [50000, 60000, 70000]
df

       Name  Age   City  Salary
0    Shruti   20  Thane   50000
1  Shravani   15  Thane   60000
2      Anuj   15  Thane   70000

In [39]:
# remove column
#df.drop('Salary', axis = 1)
#df

In [40]:
df.drop('Salary', axis = 1, inplace = True)

In [41]:
df

       Name  Age   City
0    Shruti   20  Thane
1  Shravani   15  Thane
2      Anuj   15  Thane

In [42]:
# add age
df['Age'] = df['Age']+1
df

       Name  Age   City
0    Shruti   21  Thane
1  Shravani   16  Thane
2      Anuj   16  Thane